# //Найдите остаток при делении числа a на b.
# Формат ввода
# 123, 12
# Формат вывода
# 3

a = int(input())
b = int(input())
print (a%b)
